tap 'shopify/shopify'

brew "asdf"
brew "coreutils"
brew "curl"
brew "gawk"
brew "git"
brew "gpg"
brew "groff"
brew "peco"
brew "stow"
brew "starship"
brew "themekit"
brew "zsh-autosuggestions"

cask "alacritty"
cask "android-studio"
cask "appcleaner"
cask "chatgpt"
cask "clipy"
cask "coteditor"
cask "cursor"
cask "cyberduck"
cask "discord"
cask "disk-diet"
cask "docker"
cask "google-chrome"
cask "google-cloud-sdk"
cask "intellij-idea"
cask "keyboardcleantool"
cask "notion"
cask "phpstorm"
cask "postman"
cask "rectangle"
cask "safeincloud-password-manager"
cask "slack"
cask "visual-studio-code"
cask "webstorm"
cask "zoom"
