# Core development tools - pinned to stable versions
brew "asdf"                    # Runtime version manager
brew "curl"                    # HTTP client
brew "git"                     # Version control
brew "gh"                      # GitHub CLI
brew "gpg"                     # GNU Privacy Guard
brew "groff"                   # GNU troff document formatter
brew "peco"                    # Interactive filtering tool
brew "stow"                    # Symlink farm manager
brew "starship"                # Cross-shell prompt
brew "zsh-autosuggestions"     # Zsh autosuggestions plugin

# Fonts
cask "font-jetbrains-mono-nerd-font"  # JetBrains Mono Nerd Font (used by Alacritty)

# macOS Applications
cask "alacritty"                      # GPU-accelerated terminal emulator
cask "appcleaner"                     # Application uninstaller
cask "arc"                            # Arc browser
cask "chatgpt"                        # ChatGPT desktop app
cask "claude"                         # Claude desktop app
cask "claude-code"                    # Claude Code CLI
cask "codex"                          # OpenAI Codex CLI
cask "clipy"                          # Clipboard extension
cask "coteditor"                      # Text editor for macOS
cask "cyberduck"                      # FTP/SFTP client
cask "discord"                        # Voice and text chat
cask "disk-diet"                      # Disk cleanup utility
cask "docker"                         # Container platform
cask "google-chrome"                  # Web browser
cask "google-cloud-sdk"               # Google Cloud command-line tools
cask "intellij-idea"                  # Java IDE
cask "keyboardcleantool"              # Keyboard cleaning utility
cask "notion"                         # Note-taking and productivity
cask "phpstorm"                       # PHP IDE
cask "postman"                        # API development and testing
cask "rectangle"                      # Window management
cask "safeincloud-password-manager"   # Password manager
cask "slack"                          # Team communication
cask "visual-studio-code"             # Code editor
cask "webstorm"                       # JavaScript IDE
cask "zoom"                           # Video conferencing
